app/Controllers/TesinaController.php

    public function login()
    {
        $userModel = new UserModel();
        $usuario = (string) $this->request->getPost('usuario');
        $password = (string) $this->request->getPost('password');

        $user = $userModel->where('usuario', $usuario)->first();
---
SELECT *
FROM `users`
WHERE `usuario` = 'Demo'
 LIMIT 1